cmsis-svd/cmsis-svd/data/NXP/S32K14xW.svd
        <register>
          <name>ESR1</name>
          <description>Error and Status 1 register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERRINT</name>
              <description>Error Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates setting of any error bit in the Error and Status register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOFFINT</name>
              <description>Bus Off Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>FlexCAN module entered Bus Off state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>FlexCAN In Reception</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>FlexCAN is not receiving a message.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>FlexCAN is receiving a message.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTCONF</name>
              <description>Fault Confinement State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>error_active</name>
                  <description>Error Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>error_passive</name>
                  <description>Error Passive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bus_off</name>
                  <description>Bus Off</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>FlexCAN In Transmission</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>transmit_message_no</name>
                  <description>FlexCAN is not transmitting a message.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>transmit_message_yes</name>
                  <description>FlexCAN is transmitting a message.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>IDLE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>can_bus_not_idle</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>can_bus_idle</name>
                  <description>CAN bus is now IDLE.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXWRN</name>
              <description>Rx Error Warning</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXERRCNT_LT_96</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXERRCNT_GTE_96</name>
                  <description>RXERRCNT is greater than or equal to 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXWRN</name>
              <description>TX Error Warning</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXERRCNT_LT_96</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXERRCNT_GTE_96</name>
                  <description>TXERRCNT is greater than or equal to 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STFERR</name>
              <description>Stuffing Error</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stuffing_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>stuffing_error_yes</name>
                  <description>A stuffing error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMERR</name>
              <description>Form Error</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>form_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>form_error_yes</name>
                  <description>A Form Error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCERR</name>
              <description>Cyclic Redundancy Check Error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_error_yes</name>
                  <description>A CRC error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACKERR</name>
              <description>Acknowledge Error</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK_error_yes</name>
                  <description>An ACK error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT0ERR</name>
              <description>Bit0 Error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bit0_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit0_error_yes</name>
                  <description>At least one bit sent as dominant is received as recessive.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT1ERR</name>
              <description>Bit1 Error</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bit1_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit1_error_yes</name>
                  <description>At least one bit sent as recessive is received as dominant.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWRNINT</name>
              <description>Rx Warning Interrupt Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Rx_warning_int_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rx_warning_int_yes</name>
                  <description>The Rx error counter transitioned from less than 96 to greater than or equal to 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWRNINT</name>
              <description>Tx Warning Interrupt Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Tx_warning_int_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tx_warning_int_yes</name>
                  <description>The Tx error counter transitioned from less than 96 to greater than or equal to 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCH</name>
              <description>CAN Synchronization Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_bus_sync_no</name>
                  <description>FlexCAN is not synchronized to the CAN bus.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_bus_sync_yes</name>
                  <description>FlexCAN is synchronized to the CAN bus.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOFFDONEINT</name>
              <description>Bus Off Done Interrupt</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bus_off_not_done</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bus_off_done</name>
                  <description>FlexCAN module has completed Bus Off process.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRINT_FAST</name>
              <description>Error interrupt for errors detected in Data Phase of CAN FD frames with BRS bit set</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>errors_data_phase_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>errors_data_phase_yes</name>
                  <description>Indicates setting of any error bit detected in the data phase of CAN FD frames with the BRS bit set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERROVR</name>
              <description>Error Overrun</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>overrun_not_occurred</name>
                  <description>Overrun has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>overrun_occurred</name>
                  <description>Overrun has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STFERR_FAST</name>
              <description>Stuffing Error in the Data Phase of CAN FD frames with the BRS bit set</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stuffing_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>stuffing_error_yes</name>
                  <description>A stuffing error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMERR_FAST</name>
              <description>Form Error in the Data Phase of CAN FD frames with the BRS bit set</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>form_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>form_error_yes</name>
                  <description>A form error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCERR_FAST</name>
              <description>Cyclic Redundancy Check Error in the CRC field of CAN FD frames with the BRS bit set</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_error_yes</name>
                  <description>A CRC error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT0ERR_FAST</name>
              <description>Bit0 Error in the Data Phase of CAN FD frames with the BRS bit set</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bit0_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit0_error_yes</name>
                  <description>At least one bit sent as dominant is received as recessive.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT1ERR_FAST</name>
              <description>Bit1 Error in the Data Phase of CAN FD frames with the BRS bit set</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bit1_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit1_error_yes</name>
                  <description>At least one bit sent as recessive is received as dominant.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IMASK2</name>
          <description>Interrupt Masks 2 register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUF63TO32M</name>
              <description>Buffer MB i Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMASK1</name>
          <description>Interrupt Masks 1 register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUF31TO0M</name>
              <description>Buffer MB i Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFLAG2</name>
          <description>Interrupt Flags 2 register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUF63TO32I</name>
              <description>Buffer MB i Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
