cmsis-svd/cmsis-svd/data/NXP/S32K14xW.svd
        <register>
          <name>SWOCTRL</name>
          <description>FTM Software Output Control</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0OC</name>
              <description>Channel 0 Software Output Control Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1OC</name>
              <description>Channel 1 Software Output Control Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH1OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2OC</name>
              <description>Channel 2 Software Output Control Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3OC</name>
              <description>Channel 3 Software Output Control Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH3OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4OC</name>
              <description>Channel 4 Software Output Control Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH4OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5OC</name>
              <description>Channel 5 Software Output Control Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH5OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6OC</name>
              <description>Channel 6 Software Output Control Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH6OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH6OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7OC</name>
              <description>Channel 7 Software Output Control Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH7OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH7OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH0OCV</name>
              <description>Channel 0 Software Output Control Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1OCV</name>
              <description>Channel 1 Software Output Control Value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH1OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2OCV</name>
              <description>Channel 2 Software Output Control Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3OCV</name>
              <description>Channel 3 Software Output Control Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH3OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4OCV</name>
              <description>Channel 4 Software Output Control Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH4OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5OCV</name>
              <description>Channel 5 Software Output Control Value</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH5OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6OCV</name>
              <description>Channel 6 Software Output Control Value</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH6OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH6OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7OCV</name>
              <description>Channel 7 Software Output Control Value</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH7OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH7OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
