cmsis-svd/cmsis-svd/data/NXP/S32K14xW.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMC</name>
      <description>PMC</description>
      <groupName>PMC</groupName>
      <baseAddress>0x4007D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LVDSC2</name>
          <description>Low Voltage Detect Status and Control 2 Register</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>LVWIE</name>
              <description>Low-Voltage Warning Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVWIE_0</name>
                  <description>Hardware interrupt disabled (use polling)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVWIE_1</name>
                  <description>Request a hardware interrupt when LVWF=1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVWACK</name>
              <description>Low-Voltage Warning Acknowledge</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LVWF</name>
              <description>Low-Voltage Warning Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVWF_0</name>
                  <description>Low-voltage warning event not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVWF_1</name>
                  <description>Low-voltage warning event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REGSC</name>
          <description>Regulator Status and Control Register</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xBF</resetMask>
          <fields>
            <field>
              <name>BIASEN</name>
              <description>Bias Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIASEN_0</name>
                  <description>Biasing disabled, core logic can run in full performance</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIASEN_1</name>
                  <description>Biasing enabled, core logic is slower and there are restrictions in allowed system clock speed (see Data Sheet for details)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKBIASDIS</name>
              <description>Clock Bias Disable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKBIASDIS_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKBIASDIS_1</name>
                  <description>In VLPS mode, the bias currents and reference voltages for the following clock modules are disabled: SIRC, FIRC, PLL. (if available on device)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGFPM</name>
              <description>Regulator in Full Performance Mode Status Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGFPM_0</name>
                  <description>Regulator is in low power mode or transition to/from</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REGFPM_1</name>
                  <description>Regulator is in full performance mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPOSTAT</name>
              <description>LPO Status Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPOSTAT_0</name>
                  <description>Low power oscillator in low phase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOSTAT_1</name>
                  <description>Low power oscillator in high phase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPODIS</name>
              <description>LPO Disable Bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPODIS_0</name>
                  <description>Low power oscillator enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPODIS_1</name>
                  <description>Low power oscillator disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LVRFLG</name>
          <description>Low Voltage Reset Flags Register</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x40</resetMask>
          <fields>
            <field>
              <name>LVRF</name>
              <description>LVR Core Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>LVRLPF</name>
              <description>LVR in low power mode core Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>LVRXF</name>
              <description>LVR External Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>LVRXLPF</name>
              <description>LVR external in low power mode flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>LVR3F</name>
              <description>LVR 3V Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>LVR3FLSF</name>
              <description>LVR 3V Flash memory Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PORF</name>
              <description>POR Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPOTRIM</name>
          <description>Low Power Oscillator Trim Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0</resetMask>
          <fields>
            <field>
              <name>LPOTRIM</name>
              <description>LPO trimming bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
